Revit 2026 API

# WorksetConfiguration Methods

---

The WorksetConfiguration type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Close |  |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Open |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

WorksetConfiguration Class

Autodesk.Revit.DB Namespace